{
  "roversa": "Bloques para conducir a Roversa.",
  "roversa.backward": "Movimiento hacia atrás. Llama a parar para detener.",
  "roversa.biasDriving": "Aplicar preferencia a las llantas. 0 a 50 para izquierda, 50 a 100 para derecha.",
  "roversa.biasDriving|param|bias": "eg: 50",
  "roversa.driveBackwards": "Se dirige hacia atras la distancia indicada y luego se detiene.",
  "roversa.driveBackwards|param|howFar": "distancia de movimiento.",
  "roversa.driveForwards": "Conduce adelante la distancia indicada y luego se detiene.",
  "roversa.driveForwards|param|howFar": "distancia para moverse.",
  "roversa.forward": "Conduce adelante. Llama a parar para detenerse.",
  "roversa.left": "Girar a la izquuerda. Llama a parar para detenerse.",
  "roversa.right": "Girar a la derecha. Llama a parar para detenerse.",
  "roversa.setDegreesPerSecond": "Permite ajustar la cantidad de giros de Roversa. Esto permite calibrar el giro x grados.",
  "roversa.setDegreesPerSecond|param|degPerSec": "Cuántos grados por segundo hace Roversa.",
  "roversa.setDistancePerSecond": "Permite que ajustar el mini hacia adelante / distancia de reversa. Esto permite girar ajustar los comandos de desplazamiento x distancia.",
  "roversa.setDistancePerSecond|param|distPerSec": ": Cuántos mm por segundos hace Roversa.",
  "roversa.stop": "Detiene los servos 360 en lugar de escribir 90, que puede no detener el movimiento del servo si está fuera de ajuste esto detiene el envío de pulsos de servo, que tiene el mismo efecto. En un servo normal, esto detendrá el servo donde está, en lugar de devolverlo a la posición neutral.",
  "roversa.turnLeft": "Girar a la izquierda a través de los grados solicitados y luego se detiene necesita NumberOfDegreesPerSec para ser preciso, debido a que utiliza un giro simple, espera, se detiene. Hace funcionar los servos a menor velocidad para evitar que derrapen las ruedas.",
  "roversa.turnLeft|param|deg": "Qué tan lejos gira, ej: 90",
  "roversa.turnRight": "Girar a la derecha a través de los grados solicitados y luego se detiene necesita Numerodegradosporsecungo para ser preciso, debido a que utiliza giro simple, espera, se detiene. Hace funcionar los servos a menor velocidad para evitar que derrapen las ruedas.",
  "roversa.turnRight|param|deg": "Qué tanto gira, ej: 90 grados.",
  "RoversaEvent": "El evento indicado por los pines de Roversa.",
  "RoversaPin": "Los pines usados por Roversa.",
  "roversa.isPressed": "Determina si un botón es presionado.",
  "roversa.isPressed|param|button": "el pin que actúa como un botón.",
  "roversa.onEvent": "Registra el código que va a correr cuando un evento es detectado."
}
